# GetObjMaterialName

## Description
```pascal
FUNCTION GetObjMaterialName(
				h                : HANDLE;
				VAR materialName : STRING) : BOOLEAN;
```

```python

def vs.GetObjMaterialName(h):
    return (BOOLEAN, materialName)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE||
|materialName|STRING||

## Version
Availability: from Vectorworks 2021
## Category
* Object Attributes